app/views/tweets/index.html.erb

SELECT `tweets`.* FROM `tweets`
SELECT COUNT(*) AS count_all, `tweets`.`body` AS tweets_body FROM `tweets` GROUP BY `tweets`.`body`
---

<%= pie_chart Tweet.group(:body).count %>

SELECT `tags`.* FROM `tags`
---
<%= form_tag tweets_path, method: :get, class: 'boards__searchForm' do %>
<%= select_tag :tag_id,
                options_from_collection_for_select(Tag.all, :id, :name, params[:tag_id]),
                {

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 8
---
                <%= link_to tweet_like_path(id: t.id, tweet_id: t.id), method: :delete do %>
                <i class="fas fa-heart"></i><%= t.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 8
---
                <%= link_to tweet_likes_path(id: t.id, tweet_id: t.id), method: :post do %>
                <i class="far fa-heart"></i><%= t.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 1
---
                <% else %>
                <i class="far fa-heart"></i><%= t.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 2
---
                <%= link_to tweet_like_path(id: t.id, tweet_id: t.id), method: :delete do %>
                <i class="fas fa-heart"></i><%= t.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 1
---
                <%= link_to tweet_likes_path(id: t.id, tweet_id: t.id), method: :post do %>
                <i class="far fa-heart"></i><%= t.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 2
---
                <% else %>
                <i class="far fa-heart"></i><%= t.likes.count %>