app/views/tweets/index.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 11
---
                <%= link_to tweet_like_path(id: t.id, tweet_id: t.id), method: :delete do %>
                <i class="fas fa-heart"></i><%= t.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 7
---
                <%= link_to tweet_like_path(id: t.id, tweet_id: t.id), method: :delete do %>
                <i class="fas fa-heart"></i><%= t.likes.count %>