app/views/tweets/new.html.erb

SELECT `tags`.* FROM `tags`
---
        <div class='form-group'>
        <%= f.collection_check_boxes(:tag_ids, Tag.all, :id, :name) do |tag| %>