app/views/tweets/new.html.erb

    <div class='form-group'>
        <%= f.collection_check_boxes(:tag_ids, Tag.all, :id, :name) do |tag| %>
---
SELECT `tags`.* FROM `tags`