app/views/tweets/show.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 11
---
        <%= link_to tweet_like_path(@tweet), method: :delete do %>
            <i class="fas fa-heart"></i><%= @tweet.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 11
---
        <%= link_to tweet_likes_path(@tweet), method: :post do %>
            <i class="far fa-heart"></i><%= @tweet.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 11
---
<% else %>
    <i class="far fa-heart"></i><%= @tweet.likes.count %>

SELECT `tags`.* FROM `tags` INNER JOIN `tweet_tag_relations` ON `tags`.`id` = `tweet_tag_relations`.`tag_id` WHERE `tweet_tag_relations`.`tweet_id` = 11
---

<% @tweet.tags.each do |tag| %>

SELECT `users`.* FROM `users` INNER JOIN `likes` ON `users`.`id` = `likes`.`user_id` WHERE `likes`.`tweet_id` = 1
---
    <div>
        <%= c.user.email unless c.user.blank? %>