app/views/users/show.html.erb


<% @user.tweets.each do |t| %>
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 2