app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE ((body LIKE '%aaa%' ) OR (body LIKE '%bbb%' )) LIMIT 2 OFFSET 0
---
    def index
        # @tweets = params[:tag_id].present? ? Tag.find(params[:tag_id]).tweets : Tweet.all.page(params[:page]).per(2)
        @tweets = Tweet.where("body LIKE ? ", "%" + "aaa" + "%").or(Tweet.where("body LIKE ? ", "%" + "bbb" + "%")).page(params[:page]).per(1)