app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets` INNER JOIN `tweet_tag_relations` ON `tweets`.`id` = `tweet_tag_relations`.`tweet_id` WHERE `tweet_tag_relations`.`tag_id` = 4
SELECT `tags`.* FROM `tags` WHERE `tags`.`id` = 2 LIMIT 1
SELECT COUNT(*) AS count_all, CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(`users`.`created_at`, '+00:00', 'America/Los_Angeles'), '%Y-%m-%d 00:00:00'), 'America/Los_Angeles', '+00:00') AS convert_tz_date_format_convert_tz_users_created_at_00_00_america_los_angeles_y_m_d_00_00_00_america_los_angeles_00_00 FROM `users` WHERE (`users`.`created_at` IS NOT NULL) GROUP BY CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(`users`.`created_at`, '+00:00', 'America/Los_Angeles'), '%Y-%m-%d 00:00:00'), 'America/Los_Angeles', '+00:00')
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 10
SELECT COUNT(*) FROM `tweets` WHERE ((body LIKE '%aaa%' ) OR (body LIKE '%bbb%' ))
---
    def index
        @tweets = params[:tag_id].present? ? Tag.find(params[:tag_id]).tweets : Tweet.all
        @rank_tweets = Tweet.all.sort {|a,b| b.liked_users.count <=> a.liked_users.count}

INSERT INTO `tweets` (`body`, `created_at`, `updated_at`, `user_id`, `star`, `video`) VALUES ('movie', '2020-10-26 14:47:40.442704', '2020-10-26 14:47:40.442704', 2, 3, 'bandicam_2020-10-18_10-40-34-767.mp4')
---
    def create
        tweet = Tweet.new(tweet_params)
        tweet.user_id = current_user.id
        if tweet.save

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 11 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'bbbbb', `tweets`.`updated_at` = '2020-09-30 15:30:02.678505' WHERE `tweets`.`id` = 11
---
    def update
        ttweet = Tweet.find(params[:id])
        if ttweet.update(tweet_params)