app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @user_tweets = Tweet.where(user_id: @user.id).where("created_at > ?", Time.current.yesterday)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 1 AND (created_at > '2020-11-13 03:38:58.536923')