app/models/user.rb

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `name`, `provider`, `uid`) VALUES ('y2pgftpe@keio.jp', '$2a$12$ij.41tB2hzMBNCBe.eIGdOl0AYowS3GcGVpD5hWcqhH.oO09I/49.', '2020-10-29 13:58:46.168763', '2020-10-29 13:58:46.168763', '那仁満徳', 'google_oauth2', '106409334398779068043')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'google_oauth2' AND `users`.`uid` = '106409334398779068043' ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`tweet_id` = 1 LIMIT 1
---
  def already_liked?(tweet)
    self.likes.exists?(tweet_id: tweet.id)